---
kind: property
id: P:Autodesk.Revit.DB.Electrical.WireMaterialTypeSet.Size
source: html/78002a31-2e8f-7006-6e2b-2eeb7bb7b986.htm
---
# Autodesk.Revit.DB.Electrical.WireMaterialTypeSet.Size Property

Returns the number of wire material types that are in the set.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```